Messwerte/Archiv/Raw/apache_benchmark_repeat35/default/runsc/httpd/target_count_2/repeat_14/1.txt
2020/02/06 10:03:09 Running: ab -c 100 -t 30 -n 1000000 http://192.168.3.100:8001/
2020/02/06 10:03:40 This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/
Benchmarking 192.168.3.100 (be patient)
Completed 100000 requests
Finished 102829 requests
Server Software:        Apache/2.4.41
Server Hostname:        192.168.3.100
Server Port:            8001
Document Path:          /
Document Length:        45 bytes
Concurrency Level:      100
Time taken for tests:   30.000 seconds
Complete requests:      102829
Failed requests:        0
Total transferred:      29717870 bytes
HTML transferred:       4627350 bytes
Requests per second:    3427.62 [#/sec] (mean)
Time per request:       29.175 [ms] (mean)
Time per request:       0.292 [ms] (mean, across all concurrent requests)
Transfer rate:          967.37 [Kbytes/sec] received
Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    4   3.6      3      49
Processing:     1   25  51.9      9    1026
Waiting:        0   22  51.4      7    1025
Total:          1   29  51.9     14    1030
Percentage of the requests served within a certain time (ms)
  50%     14
  66%     18
  75%     22
  80%     25
  90%     38
  95%    212
  98%    223
  99%    229
 100%   1030 (longest request)
2020/02/06 10:03:40 Matched stat line [Connect:        0    4   3.6      3      49 Connect 0 4 3.6 3 49]
2020/02/06 10:03:40 Matched stat line [Processing:     1   25  51.9      9    1026 Processing 1 25 51.9 9 1026]
2020/02/06 10:03:40 Matched stat line [Waiting:        0   22  51.4      7    1025 Waiting 0 22 51.4 7 1025]
2020/02/06 10:03:40 Matched stat line [Total:          1   29  51.9     14    1030 Total 1 29 51.9 14 1030]
2020/02/06 10:03:40 Matched percentline [  50%     14 50 14]
2020/02/06 10:03:40 Matched percentline [  66%     18 66 18]
2020/02/06 10:03:40 Matched percentline [  75%     22 75 22]
2020/02/06 10:03:40 Matched percentline [  80%     25 80 25]
2020/02/06 10:03:40 Matched percentline [  90%     38 90 38]
2020/02/06 10:03:40 Matched percentline [  95%    212 95 212]
2020/02/06 10:03:40 Matched percentline [  98%    223 98 223]
2020/02/06 10:03:40 Matched percentline [  99%    229 99 229]
2020/02/06 10:03:40 Matched percentline [ 100%   1030 100 1030]
{"connect":{"max":49,"mean":4,"median":3,"min":0,"stdDev":3.5999999046325684},"percentiles":{"100":1030,"50":14,"66":18,"75":22,"80":25,"90":38,"95":212,"98":223,"99":229},"processing":{"max":1026,"mean":25,"median":9,"min":1,"stdDev":51.900001525878906},"total":{"max":1030,"mean":29,"median":14,"min":1,"stdDev":51.900001525878906},"waiting":{"max":1025,"mean":22,"median":7,"min":0,"stdDev":51.400001525878906}}